In [32]:
import pandas as pd

In [33]:
df = pd.read_csv("Consumo_cerveja.csv")

In [34]:
df.head()

,Data,Temperatura Media (C),Temperatura Minima (C),Temperatura Maxima (C),Precipitacao (mm),Final de Semana,Consumo de cerveja (litros)
0,2015-01-01,"27,3","23,9","32,5",0,0.0,25.461
1,2015-01-02,"27,02","24,5","33,5",0,0.0,28.972
2,2015-01-03,"24,82","22,4","29,9",0,1.0,30.814
3,2015-01-04,"23,98","21,5","28,6","1,2",1.0,29.799
4,2015-01-05,"23,82",21,"28,3",0,0.0,28.900

In [35]:
df.isnull().sum()

Data                           576
Temperatura Media (C)          576
Temperatura Minima (C)         576
Temperatura Maxima (C)         576
Precipitacao (mm)              576
Final de Semana                576
Consumo de cerveja (litros)    576
dtype: int64

In [36]:
df.shape

(941, 7)

In [37]:
df = df.dropna()

In [38]:
df.isnull().sum()

Data                           0
Temperatura Media (C)          0
Temperatura Minima (C)         0
Temperatura Maxima (C)         0
Precipitacao (mm)              0
Final de Semana                0
Consumo de cerveja (litros)    0
dtype: int64

In [39]:
df.dtypes

Data                            object
Temperatura Media (C)           object
Temperatura Minima (C)          object
Temperatura Maxima (C)          object
Precipitacao (mm)               object
Final de Semana                float64
Consumo de cerveja (litros)    float64
dtype: object

In [40]:
df.columns = ["Date","Temp(med)", "Temp(min)", "Temp(Max)", "Rainfall(mm)", "weekend", "consumption"]

In [41]:
df.head()

         Date Temp(med) Temp(min) Temp(Max) Rainfall(mm)  weekend  consumption
0  2015-01-01      27,3      23,9      32,5            0      0.0       25.461
1  2015-01-02     27,02      24,5      33,5            0      0.0       28.972
2  2015-01-03     24,82      22,4      29,9            0      1.0       30.814
3  2015-01-04     23,98      21,5      28,6          1,2      1.0       29.799
4  2015-01-05     23,82        21      28,3            0      0.0       28.900

In [42]:
df.drop(["Date"],1,inplace = True)

In [43]:
df.head(2)

  Temp(med) Temp(min) Temp(Max) Rainfall(mm)  weekend  consumption
0      27,3      23,9      32,5            0      0.0       25.461
1     27,02      24,5      33,5            0      0.0       28.972

In [49]:
for x in list(df)[:4]:
    df[x] = df[x].str.replace(",", ".").astype(float)

In [50]:
df.dtypes

Temp(med)       float64
Temp(min)       float64
Temp(Max)       float64
Rainfall(mm)    float64
weekend         float64
consumption     float64
dtype: object

In [51]:
df["weekend"] = df["weekend"].astype("category")

In [52]:
df.dtypes

Temp(med)        float64
Temp(min)        float64
Temp(Max)        float64
Rainfall(mm)     float64
weekend         category
consumption      float64
dtype: object

In [53]:
df.head()

   Temp(med)  Temp(min)  Temp(Max)  Rainfall(mm) weekend  consumption
0      27.30       23.9       32.5           0.0     0.0       25.461
1      27.02       24.5       33.5           0.0     0.0       28.972
2      24.82       22.4       29.9           0.0     1.0       30.814
3      23.98       21.5       28.6           1.2     1.0       29.799
4      23.82       21.0       28.3           0.0     0.0       28.900

In [54]:
X = df.drop(["consumption"],1)
y = df["consumption"]

In [55]:
df.describe()

        Temp(med)   Temp(min)   Temp(Max)  Rainfall(mm)  consumption
count  365.000000  365.000000  365.000000    365.000000   365.000000
mean    21.226356   17.461370   26.611507      5.196712    25.401367
std      3.180108    2.826185    4.317366     12.417844     4.399143
min     12.900000   10.600000   14.500000      0.000000    14.343000
25%     19.020000   15.300000   23.800000      0.000000    22.008000
50%     21.380000   17.900000   26.900000      0.000000    24.867000
75%     23.280000   19.600000   29.400000      3.200000    28.631000
max     28.860000   24.500000   36.500000     94.800000    37.937000

In [111]:
from sklearn.neighbors import KNeighborsRegressor
from sklearn.metrics import mean_squared_error, r2_score
import numpy as np
from sklearn.model_selection import train_test_split as tts, GridSearchCV, cross_val_score

In [112]:
X_train, X_test, y_train, y_test = tts(X,y,random_state = 21, test_size = 0.3)

In [113]:
knn = KNeighborsRegressor()

In [114]:
knn.fit(X_train, y_train)
knn.score(X_test,y_test)

0.6020021251137044

In [115]:
params = {"n_neighbors":np.arange(1,10,1), "metric":["euclidean", "minkowski", "jaccard", "cosine"]}

In [116]:
params

{'n_neighbors': array([1, 2, 3, 4, 5, 6, 7, 8, 9]),
 'metric': ['euclidean', 'minkowski', 'jaccard', 'cosine']}

In [118]:
max(cross_val_score(knn, X,y, cv = 10))

0.7563842121716744

In [119]:
knn_cv = GridSearchCV(estimator=knn, param_grid=params, cv = 10)

In [120]:
knn_cv.fit(X,y)

GridSearchCV(cv=10, error_score='raise-deprecating',
       estimator=KNeighborsRegressor(algorithm='auto', leaf_size=30, metric='minkowski',
          metric_params=None, n_jobs=None, n_neighbors=5, p=2,
          weights='uniform'),
       fit_params=None, iid='warn', n_jobs=None,
       param_grid={'n_neighbors': array([1, 2, 3, 4, 5, 6, 7, 8, 9]), 'metric': ['euclidean', 'minkowski', 'jaccard', 'cosine']},
       pre_dispatch='2*n_jobs', refit=True, return_train_score='warn',
       scoring=None, verbose=0)

In [121]:
knn_cv.best_score_

0.5234637590420743

In [122]:
knn_cv.best_params_

{'metric': 'euclidean', 'n_neighbors': 9}

In [123]:
knn_cv.best_estimator_

KNeighborsRegressor(algorithm='auto', leaf_size=30, metric='euclidean',
          metric_params=None, n_jobs=None, n_neighbors=9, p=2,
          weights='uniform')

In [77]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

In [78]:
X1 = X.copy()

In [91]:
X1["weekend"] = X1["weekend"].astype(int)

In [92]:
X1.head()

   Temp(med)  Temp(min)  Temp(Max)  Rainfall(mm)  weekend
0      27.30       23.9       32.5           0.0        0
1      27.02       24.5       33.5           0.0        0
2      24.82       22.4       29.9           0.0        1
3      23.98       21.5       28.6           1.2        1
4      23.82       21.0       28.3           0.0        0

In [100]:
weekend = X["weekend"]

In [103]:
X.drop(["weekend"],1,inplace = True)

In [108]:
X = pd.DataFrame(scaler.fit_transform(X), columns = list(X))

In [109]:
X["weekend"] = weekend

In [110]:
X.head()

   Temp(med)  Temp(min)  Temp(Max)  Rainfall(mm) weekend
0   1.912508   2.281333   1.365781     -0.419062     0.0
1   1.824340   2.493924   1.597722     -0.419062     0.0
2   1.131590   1.749853   0.762735     -0.419062     1.0
3   0.867085   1.430966   0.461212     -0.322294     1.0
4   0.816703   1.253806   0.391630     -0.419062     0.0